tutorials/heatTransfer/buoyantSimpleFoam/buoyantCavity/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    frontAndBack
    {
        type            wall;
        nFaces          1050;
        startFace       228225;
    }
    topAndBottom
    {
        type            wall;
        nFaces          10500;
        startFace       229275;
    }
    hot
    {
        type            wall;
        nFaces          2250;
        startFace       239775;
    }
    cold
    {
        type            wall;
        nFaces          2250;
        startFace       242025;
    }
)

// ************************************************************************* //
